sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_adc12.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/

  Redistribution and use in source and binary forms, with or without
  modification, are permitted provided that the following conditions
  are met:

   Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_adc12__include
#define ti_devices_msp_peripherals_hw_adc12__include

/* Filename: hw_adc12.h */
/* Revised: 2024-02-04 23:18:52 */
/* Revision: 8d44a0380c79ed6c597a10a9f2b1bed57fc8b226 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* ADC12 Registers
******************************************************************************/
#define ADC12_SVTMEM_OFS                         ((uint32_t)0x00000000U)
#define ADC12_DMA_TRIG_OFS                       ((uint32_t)0x00001080U)
#define ADC12_GEN_EVENT_OFS                      ((uint32_t)0x00001050U)
#define ADC12_CPU_INT_OFS                        ((uint32_t)0x00001020U)
#define ADC12_GPRCM_OFS                          ((uint32_t)0x00000800U)
#define ADC12_ULLMEM_OFS                         ((uint32_t)0x00000000U)


/** @addtogroup ADC12_SVTMEM
  @{
*/

typedef struct {
       uint32_t RESERVED0[88];
  __I  uint32_t FIFODATA;                          /* !< (@ 0x00000160) FIFO Data Register */
       uint32_t RESERVED1[71];
  __I  uint32_t MEMRES[24];                        /* !< (@ 0x00000280) Memory Result Register */
} ADC12_SVTMEM_Regs;

/*@}*/ /* end of group ADC12_SVTMEM */

/** @addtogroup ADC12_PERIPHERALREGIONSVT
  @{
*/

typedef struct {
  ADC12_SVTMEM_Regs  SVTMEM;                            /* !< (@ 0x00000000) */
} ADC12_PERIPHERALREGIONSVT_Regs;

/*@}*/ /* end of group ADC12_PERIPHERALREGIONSVT */

/** @addtogroup ADC12_DMA_TRIG
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001080) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001088) Interrupt mask extension */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001090) Raw interrupt status extension */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001098) Masked interrupt status extension */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x000010A0) Interrupt set extension */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x000010A8) Interrupt clear extension */
} ADC12_DMA_TRIG_Regs;

/*@}*/ /* end of group ADC12_DMA_TRIG */

/** @addtogroup ADC12_GEN_EVENT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001050) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) Interrupt clear */
} ADC12_GEN_EVENT_Regs;

/*@}*/ /* end of group ADC12_GEN_EVENT */

/** @addtogroup ADC12_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} ADC12_CPU_INT_Regs;

/*@}*/ /* end of group ADC12_CPU_INT */

/** @addtogroup ADC12_GPRCM
  @{
*/

