sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_adc12.h
#define ADC12_DMA_TRIG_RIS_MEMRESIFG20_MASK      ((uint32_t)0x10000000U)         /* !< Raw interrupt status for MEMRES20.
                                                                                    This bit is set to 1 when MEMRES20 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES20 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG20_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG20_SET       ((uint32_t)0x10000000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_RIS[MEMRESIFG22] Bits */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG22_OFS       (30)                            /* !< MEMRESIFG22 Offset */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG22_MASK      ((uint32_t)0x40000000U)         /* !< Raw interrupt status for MEMRES22.
                                                                                    This bit is set to 1 when MEMRES22 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES22 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG22_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG22_SET       ((uint32_t)0x40000000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_RIS[MEMRESIFG23] Bits */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG23_OFS       (31)                            /* !< MEMRESIFG23 Offset */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG23_MASK      ((uint32_t)0x80000000U)         /* !< Raw interrupt status for MEMRES23.
                                                                                    This bit is set to 1 when MEMRES23 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES23 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG23_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG23_SET       ((uint32_t)0x80000000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_RIS[MEMRESIFG8] Bits */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG8_OFS        (16)                            /* !< MEMRESIFG8 Offset */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG8_MASK       ((uint32_t)0x00010000U)         /* !< Raw interrupt status for MEMRES8.
                                                                                    This bit is set to 1 when MEMRES8 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES8 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG8_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG8_SET        ((uint32_t)0x00010000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_RIS[MEMRESIFG21] Bits */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG21_OFS       (29)                            /* !< MEMRESIFG21 Offset */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG21_MASK      ((uint32_t)0x20000000U)         /* !< Raw interrupt status for MEMRES21.
                                                                                    This bit is set to 1 when MEMRES21 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES21 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG21_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_RIS_MEMRESIFG21_SET       ((uint32_t)0x20000000U)         /* !< A new data is ready to be read. */

/* ADC12_DMA_TRIG_MIS Bits */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG0] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG0_OFS        (8)                             /* !< MEMRESIFG0 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG0_MASK       ((uint32_t)0x00000100U)         /* !< Raw interrupt status for MEMRES0.
                                                                                    This bit is set to 1 when MEMRES0 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES0 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG0_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG0_SET        ((uint32_t)0x00000100U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG1] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG1_OFS        (9)                             /* !< MEMRESIFG1 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG1_MASK       ((uint32_t)0x00000200U)         /* !< Raw interrupt status for MEMRES1.
                                                                                    This bit is set to 1 when MEMRES1 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES1 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG1_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG1_SET        ((uint32_t)0x00000200U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG2] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG2_OFS        (10)                            /* !< MEMRESIFG2 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG2_MASK       ((uint32_t)0x00000400U)         /* !< Raw interrupt status for MEMRES2.
                                                                                    This bit is set to 1 when MEMRES2 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES2 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG2_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG2_SET        ((uint32_t)0x00000400U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG3] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG3_OFS        (11)                            /* !< MEMRESIFG3 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG3_MASK       ((uint32_t)0x00000800U)         /* !< Raw interrupt status for MEMRES3.
                                                                                    This bit is set to 1 when MEMRES3 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES3 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG3_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG3_SET        ((uint32_t)0x00000800U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG4] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG4_OFS        (12)                            /* !< MEMRESIFG4 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG4_MASK       ((uint32_t)0x00001000U)         /* !< Raw interrupt status for MEMRES4.
                                                                                    This bit is set to 1 when MEMRES4 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES4 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG4_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG4_SET        ((uint32_t)0x00001000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG5] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG5_OFS        (13)                            /* !< MEMRESIFG5 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG5_MASK       ((uint32_t)0x00002000U)         /* !< Raw interrupt status for MEMRES5.
                                                                                    This bit is set to 1 when MEMRES5 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES5 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG5_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG5_SET        ((uint32_t)0x00002000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG6] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG6_OFS        (14)                            /* !< MEMRESIFG6 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG6_MASK       ((uint32_t)0x00004000U)         /* !< Raw interrupt status for MEMRES6.
                                                                                    This bit is set to 1 when MEMRES6 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES6 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG6_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG6_SET        ((uint32_t)0x00004000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG7] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG7_OFS        (15)                            /* !< MEMRESIFG7 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG7_MASK       ((uint32_t)0x00008000U)         /* !< Raw interrupt status for MEMRES7.
                                                                                    This bit is set to 1 when MEMRES7 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES7 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG7_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG7_SET        ((uint32_t)0x00008000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG9] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG9_OFS        (17)                            /* !< MEMRESIFG9 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG9_MASK       ((uint32_t)0x00020000U)         /* !< Raw interrupt status for MEMRES9.
                                                                                    This bit is set to 1 when MEMRES9 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES9 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG9_CLR        ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG9_SET        ((uint32_t)0x00020000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG10] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG10_OFS       (18)                            /* !< MEMRESIFG10 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG10_MASK      ((uint32_t)0x00040000U)         /* !< Raw interrupt status for MEMRES10.
                                                                                    This bit is set to 1 when MEMRES10 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES10 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG10_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG10_SET       ((uint32_t)0x00040000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG11] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG11_OFS       (19)                            /* !< MEMRESIFG11 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG11_MASK      ((uint32_t)0x00080000U)         /* !< Raw interrupt status for MEMRES11.
                                                                                    This bit is set to 1 when MEMRES11 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES11 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG11_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG11_SET       ((uint32_t)0x00080000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG12] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG12_OFS       (20)                            /* !< MEMRESIFG12 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG12_MASK      ((uint32_t)0x00100000U)         /* !< Raw interrupt status for MEMRES12.
                                                                                    This bit is set to 1 when MEMRES12 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES12 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG12_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG12_SET       ((uint32_t)0x00100000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG13] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG13_OFS       (21)                            /* !< MEMRESIFG13 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG13_MASK      ((uint32_t)0x00200000U)         /* !< Raw interrupt status for MEMRES13.
                                                                                    This bit is set to 1 when MEMRES13 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES13 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG13_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG13_SET       ((uint32_t)0x00200000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG14] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG14_OFS       (22)                            /* !< MEMRESIFG14 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG14_MASK      ((uint32_t)0x00400000U)         /* !< Raw interrupt status for MEMRES14.
                                                                                    This bit is set to 1 when MEMRES14 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES14 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG14_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG14_SET       ((uint32_t)0x00400000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG15] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG15_OFS       (23)                            /* !< MEMRESIFG15 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG15_MASK      ((uint32_t)0x00800000U)         /* !< Raw interrupt status for MEMRES15.
                                                                                    This bit is set to 1 when MEMRES15 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES15 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG15_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG15_SET       ((uint32_t)0x00800000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG16] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG16_OFS       (24)                            /* !< MEMRESIFG16 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG16_MASK      ((uint32_t)0x01000000U)         /* !< Raw interrupt status for MEMRES16.
                                                                                    This bit is set to 1 when MEMRES16 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES16 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG16_CLR       ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG16_SET       ((uint32_t)0x01000000U)         /* !< A new data is ready to be read. */
/* ADC12_DMA_TRIG_MIS[MEMRESIFG17] Bits */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG17_OFS       (25)                            /* !< MEMRESIFG17 Offset */
#define ADC12_DMA_TRIG_MIS_MEMRESIFG17_MASK      ((uint32_t)0x02000000U)         /* !< Raw interrupt status for MEMRES17.
                                                                                    This bit is set to 1 when MEMRES17 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES17 register will clear
                                                                                    this bit, or when the corresponding
