sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_adc12.h
#define ADC12_CPU_INT_ICLR_MEMRESIFG17_OFS       (25)                            /* !< MEMRESIFG17 Offset */
#define ADC12_CPU_INT_ICLR_MEMRESIFG17_MASK      ((uint32_t)0x02000000U)         /* !< Raw interrupt status for MEMRES17.
                                                                                    This bit is set to 1 when MEMRES17 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES17 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_CPU_INT_ICLR_MEMRESIFG17_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_CPU_INT_ICLR_MEMRESIFG17_CLR       ((uint32_t)0x02000000U)         /* !< A new data is ready to be read. */
/* ADC12_CPU_INT_ICLR[MEMRESIFG18] Bits */
#define ADC12_CPU_INT_ICLR_MEMRESIFG18_OFS       (26)                            /* !< MEMRESIFG18 Offset */
#define ADC12_CPU_INT_ICLR_MEMRESIFG18_MASK      ((uint32_t)0x04000000U)         /* !< Raw interrupt status for MEMRES18.
                                                                                    This bit is set to 1 when MEMRES18 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES18 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_CPU_INT_ICLR_MEMRESIFG18_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_CPU_INT_ICLR_MEMRESIFG18_CLR       ((uint32_t)0x04000000U)         /* !< A new data is ready to be read. */
/* ADC12_CPU_INT_ICLR[MEMRESIFG19] Bits */
#define ADC12_CPU_INT_ICLR_MEMRESIFG19_OFS       (27)                            /* !< MEMRESIFG19 Offset */
#define ADC12_CPU_INT_ICLR_MEMRESIFG19_MASK      ((uint32_t)0x08000000U)         /* !< Raw interrupt status for MEMRES19.
                                                                                    This bit is set to 1 when MEMRES19 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES19 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_CPU_INT_ICLR_MEMRESIFG19_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_CPU_INT_ICLR_MEMRESIFG19_CLR       ((uint32_t)0x08000000U)         /* !< A new data is ready to be read. */
/* ADC12_CPU_INT_ICLR[MEMRESIFG20] Bits */
#define ADC12_CPU_INT_ICLR_MEMRESIFG20_OFS       (28)                            /* !< MEMRESIFG20 Offset */
#define ADC12_CPU_INT_ICLR_MEMRESIFG20_MASK      ((uint32_t)0x10000000U)         /* !< Raw interrupt status for MEMRES20.
                                                                                    This bit is set to 1 when MEMRES20 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES20 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_CPU_INT_ICLR_MEMRESIFG20_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_CPU_INT_ICLR_MEMRESIFG20_CLR       ((uint32_t)0x10000000U)         /* !< A new data is ready to be read. */
/* ADC12_CPU_INT_ICLR[MEMRESIFG22] Bits */
#define ADC12_CPU_INT_ICLR_MEMRESIFG22_OFS       (30)                            /* !< MEMRESIFG22 Offset */
#define ADC12_CPU_INT_ICLR_MEMRESIFG22_MASK      ((uint32_t)0x40000000U)         /* !< Raw interrupt status for MEMRES22.
                                                                                    This bit is set to 1 when MEMRES22 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES22 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_CPU_INT_ICLR_MEMRESIFG22_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_CPU_INT_ICLR_MEMRESIFG22_CLR       ((uint32_t)0x40000000U)         /* !< A new data is ready to be read. */
/* ADC12_CPU_INT_ICLR[MEMRESIFG23] Bits */
#define ADC12_CPU_INT_ICLR_MEMRESIFG23_OFS       (31)                            /* !< MEMRESIFG23 Offset */
#define ADC12_CPU_INT_ICLR_MEMRESIFG23_MASK      ((uint32_t)0x80000000U)         /* !< Raw interrupt status for MEMRES23.
                                                                                    This bit is set to 1 when MEMRES23 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES23 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_CPU_INT_ICLR_MEMRESIFG23_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_CPU_INT_ICLR_MEMRESIFG23_CLR       ((uint32_t)0x80000000U)         /* !< A new data is ready to be read. */
/* ADC12_CPU_INT_ICLR[MEMRESIFG8] Bits */
#define ADC12_CPU_INT_ICLR_MEMRESIFG8_OFS        (16)                            /* !< MEMRESIFG8 Offset */
#define ADC12_CPU_INT_ICLR_MEMRESIFG8_MASK       ((uint32_t)0x00010000U)         /* !< Raw interrupt status for MEMRES8.
                                                                                    This bit is set to 1 when MEMRES8 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES8 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_CPU_INT_ICLR_MEMRESIFG8_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_CPU_INT_ICLR_MEMRESIFG8_CLR        ((uint32_t)0x00010000U)         /* !< A new data is ready to be read. */
/* ADC12_CPU_INT_ICLR[MEMRESIFG21] Bits */
#define ADC12_CPU_INT_ICLR_MEMRESIFG21_OFS       (29)                            /* !< MEMRESIFG21 Offset */
#define ADC12_CPU_INT_ICLR_MEMRESIFG21_MASK      ((uint32_t)0x20000000U)         /* !< Raw interrupt status for MEMRES21.
                                                                                    This bit is set to 1 when MEMRES21 is
                                                                                    loaded with a new conversion result.
                                                                                    Reading MEMRES21 register will clear
                                                                                    this bit, or when the corresponding
                                                                                    bit in ICLR is set to 1 */
#define ADC12_CPU_INT_ICLR_MEMRESIFG21_NO_EFFECT ((uint32_t)0x00000000U)         /* !< No new data ready. */
#define ADC12_CPU_INT_ICLR_MEMRESIFG21_CLR       ((uint32_t)0x20000000U)         /* !< A new data is ready to be read. */

/* ADC12_PWREN Bits */
/* ADC12_PWREN[ENABLE] Bits */
#define ADC12_PWREN_ENABLE_OFS                   (0)                             /* !< ENABLE Offset */
#define ADC12_PWREN_ENABLE_MASK                  ((uint32_t)0x00000001U)         /* !< Enable the power */
#define ADC12_PWREN_ENABLE_DISABLE               ((uint32_t)0x00000000U)         /* !< Disable Power */
#define ADC12_PWREN_ENABLE_ENABLE                ((uint32_t)0x00000001U)         /* !< Enable Power */
/* ADC12_PWREN[KEY] Bits */
#define ADC12_PWREN_KEY_OFS                      (24)                            /* !< KEY Offset */
#define ADC12_PWREN_KEY_MASK                     ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define ADC12_PWREN_KEY_UNLOCK_W                 ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* ADC12_RSTCTL Bits */
/* ADC12_RSTCTL[RESETSTKYCLR] Bits */
#define ADC12_RSTCTL_RESETSTKYCLR_OFS            (1)                             /* !< RESETSTKYCLR Offset */
#define ADC12_RSTCTL_RESETSTKYCLR_MASK           ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define ADC12_RSTCTL_RESETSTKYCLR_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define ADC12_RSTCTL_RESETSTKYCLR_CLR            ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* ADC12_RSTCTL[RESETASSERT] Bits */
#define ADC12_RSTCTL_RESETASSERT_OFS             (0)                             /* !< RESETASSERT Offset */
#define ADC12_RSTCTL_RESETASSERT_MASK            ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define ADC12_RSTCTL_RESETASSERT_NOP             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define ADC12_RSTCTL_RESETASSERT_ASSERT          ((uint32_t)0x00000001U)         /* !< Assert reset */
/* ADC12_RSTCTL[KEY] Bits */
#define ADC12_RSTCTL_KEY_OFS                     (24)                            /* !< KEY Offset */
#define ADC12_RSTCTL_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define ADC12_RSTCTL_KEY_UNLOCK_W                ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* ADC12_CLKCFG Bits */
/* ADC12_CLKCFG[SAMPCLK] Bits */
#define ADC12_CLKCFG_SAMPCLK_OFS                 (0)                             /* !< SAMPCLK Offset */
#define ADC12_CLKCFG_SAMPCLK_MASK                ((uint32_t)0x00000003U)         /* !< ADC sample clock source selection. */
#define ADC12_CLKCFG_SAMPCLK_ULPCLK              ((uint32_t)0x00000000U)         /* !< ULPCLK is the source of ADC sample
                                                                                    clock. */
#define ADC12_CLKCFG_SAMPCLK_SYSOSC              ((uint32_t)0x00000001U)         /* !< SYSOSC is the source of ADC sample
                                                                                    clock. */
#define ADC12_CLKCFG_SAMPCLK_HFCLK               ((uint32_t)0x00000002U)         /* !< HFCLK clock is the source of ADC
                                                                                    sample clock. Note : HFCLK may not be
                                                                                    available on all the devices. */
/* ADC12_CLKCFG[CCONRUN] Bits */
#define ADC12_CLKCFG_CCONRUN_OFS                 (4)                             /* !< CCONRUN Offset */
#define ADC12_CLKCFG_CCONRUN_MASK                ((uint32_t)0x00000010U)         /* !< CCONRUN: Forces SYSOSC to run at
                                                                                    base frequency when device is in RUN
                                                                                    mode which can be used as ADC sample
                                                                                    or conversion clock source. */
#define ADC12_CLKCFG_CCONRUN_DISABLE             ((uint32_t)0x00000000U)         /* !< ADC conversion clock source is not
                                                                                    kept continuously on during RUN mode. */
#define ADC12_CLKCFG_CCONRUN_ENABLE              ((uint32_t)0x00000010U)         /* !< ADC conversion clock source kept
                                                                                    continuously on during RUN mode. */
/* ADC12_CLKCFG[CCONSTOP] Bits */
#define ADC12_CLKCFG_CCONSTOP_OFS                (5)                             /* !< CCONSTOP Offset */
#define ADC12_CLKCFG_CCONSTOP_MASK               ((uint32_t)0x00000020U)         /* !< CCONSTOP: Forces SYSOSC to run at
                                                                                    base frequency when device is in STOP
                                                                                    mode which can be used as ADC sample
                                                                                    or conversion clock source. */
#define ADC12_CLKCFG_CCONSTOP_DISABLE            ((uint32_t)0x00000000U)         /* !< ADC conversion clock source is not
                                                                                    kept continuously on during STOP
                                                                                    mode. */
#define ADC12_CLKCFG_CCONSTOP_ENABLE             ((uint32_t)0x00000020U)         /* !< ADC conversion clock source kept
                                                                                    continuously on during STOP mode. */
/* ADC12_CLKCFG[KEY] Bits */
#define ADC12_CLKCFG_KEY_OFS                     (24)                            /* !< KEY Offset */
#define ADC12_CLKCFG_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define ADC12_CLKCFG_KEY_UNLOCK_W                ((uint32_t)0xA9000000U)         /* !< KEY to allow write access to this
                                                                                    register */

