sergz72/ARM/mspm0g350x/ti/devices/msp/peripherals/hw_adc12.h
/* ADC12_CTL2 Bits */
/* ADC12_CTL2[DF] Bits */
#define ADC12_CTL2_DF_OFS                        (0)                             /* !< DF Offset */
#define ADC12_CTL2_DF_MASK                       ((uint32_t)0x00000001U)         /* !< Data read-back format. Data is
                                                                                    always stored in binary unsigned
                                                                                    format. */
#define ADC12_CTL2_DF_UNSIGNED                   ((uint32_t)0x00000000U)         /* !< Digital result reads as Binary
                                                                                    Unsigned. */
#define ADC12_CTL2_DF_SIGNED                     ((uint32_t)0x00000001U)         /* !< Digital result reads Signed Binary.
                                                                                    (2s complement), left aligned. */
/* ADC12_CTL2[RES] Bits */
#define ADC12_CTL2_RES_OFS                       (1)                             /* !< RES Offset */
#define ADC12_CTL2_RES_MASK                      ((uint32_t)0x00000006U)         /* !< Resolution. These bits define the
                                                                                    resolution of ADC conversion result.
                                                                                    Note : A value of 3 defaults to
                                                                                    12-bits resolution. */
#define ADC12_CTL2_RES_BIT_12                    ((uint32_t)0x00000000U)         /* !< 12-bits resolution */
#define ADC12_CTL2_RES_BIT_10                    ((uint32_t)0x00000002U)         /* !< 10-bits resolution */
#define ADC12_CTL2_RES_BIT_8                     ((uint32_t)0x00000004U)         /* !< 8-bits resolution */
/* ADC12_CTL2[STARTADD] Bits */
#define ADC12_CTL2_STARTADD_OFS                  (16)                            /* !< STARTADD Offset */
#define ADC12_CTL2_STARTADD_MASK                 ((uint32_t)0x001F0000U)         /* !< Sequencer start address. These bits
                                                                                    select which MEMCTLx is used for
                                                                                    single conversion or as first MEMCTL
                                                                                    for sequence mode.  The value of
                                                                                    STARTADD is 0x00 to 0x17,
                                                                                    corresponding to MEMRES0 to MEMRES23. */
#define ADC12_CTL2_STARTADD_ADDR_00              ((uint32_t)0x00000000U)         /* !< MEMCTL0 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_01              ((uint32_t)0x00010000U)         /* !< MEMCTL1 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_02              ((uint32_t)0x00020000U)         /* !< MEMCTL2 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_03              ((uint32_t)0x00030000U)         /* !< MEMCTL3 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_04              ((uint32_t)0x00040000U)         /* !< MEMCTL4 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_05              ((uint32_t)0x00050000U)         /* !< MEMCTL5 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_06              ((uint32_t)0x00060000U)         /* !< MEMCTL6 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_07              ((uint32_t)0x00070000U)         /* !< MEMCTL7 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_08              ((uint32_t)0x00080000U)         /* !< MEMCTL8 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_09              ((uint32_t)0x00090000U)         /* !< MEMCTL9 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_10              ((uint32_t)0x000A0000U)         /* !< MEMCTL10 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_11              ((uint32_t)0x000B0000U)         /* !< MEMCTL11 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_12              ((uint32_t)0x000C0000U)         /* !< MEMCTL12 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_13              ((uint32_t)0x000D0000U)         /* !< MEMCTL13 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_14              ((uint32_t)0x000E0000U)         /* !< MEMCTL14 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_15              ((uint32_t)0x000F0000U)         /* !< MEMCTL15 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_16              ((uint32_t)0x00100000U)         /* !< MEMCTL16 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_17              ((uint32_t)0x00110000U)         /* !< MEMCTL17 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_18              ((uint32_t)0x00120000U)         /* !< MEMCTL18 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_19              ((uint32_t)0x00130000U)         /* !< MEMCTL19 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_20              ((uint32_t)0x00140000U)         /* !< MEMCTL20 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_21              ((uint32_t)0x00150000U)         /* !< MEMCTL21 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_22              ((uint32_t)0x00160000U)         /* !< MEMCTL22 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
#define ADC12_CTL2_STARTADD_ADDR_23              ((uint32_t)0x00170000U)         /* !< MEMCTL23 is selected as start
                                                                                    address of a sequence or for a single
                                                                                    conversion. */
/* ADC12_CTL2[ENDADD] Bits */
#define ADC12_CTL2_ENDADD_OFS                    (24)                            /* !< ENDADD Offset */
#define ADC12_CTL2_ENDADD_MASK                   ((uint32_t)0x1F000000U)         /* !< Sequence end address. These bits
                                                                                    select which MEMCTLx is the last one
                                                                                    for the sequence mode. The value of
                                                                                    ENDADD is 0x00 to 0x17, corresponding
                                                                                    to MEMRES0 to MEMRES23. */
#define ADC12_CTL2_ENDADD_ADDR_00                ((uint32_t)0x00000000U)         /* !< MEMCTL0 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_01                ((uint32_t)0x01000000U)         /* !< MEMCTL1 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_02                ((uint32_t)0x02000000U)         /* !< MEMCTL2 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_03                ((uint32_t)0x03000000U)         /* !< MEMCTL3 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_04                ((uint32_t)0x04000000U)         /* !< MEMCTL4 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_05                ((uint32_t)0x05000000U)         /* !< MEMCTL5 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_06                ((uint32_t)0x06000000U)         /* !< MEMCTL6 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_07                ((uint32_t)0x07000000U)         /* !< MEMCTL7 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_08                ((uint32_t)0x08000000U)         /* !< MEMCTL8 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_09                ((uint32_t)0x09000000U)         /* !< MEMCTL9 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_10                ((uint32_t)0x0A000000U)         /* !< MEMCTL10 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_11                ((uint32_t)0x0B000000U)         /* !< MEMCTL11 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_12                ((uint32_t)0x0C000000U)         /* !< MEMCTL12 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_13                ((uint32_t)0x0D000000U)         /* !< MEMCTL13 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_14                ((uint32_t)0x0E000000U)         /* !< MEMCTL14 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_15                ((uint32_t)0x0F000000U)         /* !< MEMCTL15 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_16                ((uint32_t)0x10000000U)         /* !< MEMCTL16 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_17                ((uint32_t)0x11000000U)         /* !< MEMCTL17 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_18                ((uint32_t)0x12000000U)         /* !< MEMCTL18 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_19                ((uint32_t)0x13000000U)         /* !< MEMCTL19 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_20                ((uint32_t)0x14000000U)         /* !< MEMCTL20 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_21                ((uint32_t)0x15000000U)         /* !< MEMCTL21 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_22                ((uint32_t)0x16000000U)         /* !< MEMCTL22 is selected as end address
                                                                                    of sequence. */
#define ADC12_CTL2_ENDADD_ADDR_23                ((uint32_t)0x17000000U)         /* !< MEMCTL23 is selected as end address
                                                                                    of sequence. */
/* ADC12_CTL2[DMAEN] Bits */
#define ADC12_CTL2_DMAEN_OFS                     (8)                             /* !< DMAEN Offset */
#define ADC12_CTL2_DMAEN_MASK                    ((uint32_t)0x00000100U)         /* !< Enable DMA trigger for data
                                                                                    transfer.  Note: DMAEN bit is cleared
                                                                                    by hardware based on DMA done signal
                                                                                    at the end of data transfer. Software
                                                                                    has to re-enable DMAEN bit for ADC to
                                                                                    generate DMA triggers. */
#define ADC12_CTL2_DMAEN_DISABLE                 ((uint32_t)0x00000000U)         /* !< DMA trigger not enabled */
#define ADC12_CTL2_DMAEN_ENABLE                  ((uint32_t)0x00000100U)         /* !< DMA trigger enabled */
/* ADC12_CTL2[SAMPCNT] Bits */
#define ADC12_CTL2_SAMPCNT_OFS                   (11)                            /* !< SAMPCNT Offset */
#define ADC12_CTL2_SAMPCNT_MASK                  ((uint32_t)0x0000F800U)         /* !< Number of ADC converted samples to
                                                                                    be transferred on a DMA trigger */
#define ADC12_CTL2_SAMPCNT_MIN                   ((uint32_t)0x00000000U)         /* !< Minimum value */
#define ADC12_CTL2_SAMPCNT_MAX                   ((uint32_t)0x0000C000U)         /* !< Maximum value */
/* ADC12_CTL2[FIFOEN] Bits */
#define ADC12_CTL2_FIFOEN_OFS                    (10)                            /* !< FIFOEN Offset */
#define ADC12_CTL2_FIFOEN_MASK                   ((uint32_t)0x00000400U)         /* !< Enable FIFO based operation */
#define ADC12_CTL2_FIFOEN_DISABLE                ((uint32_t)0x00000000U)         /* !< Disable */
#define ADC12_CTL2_FIFOEN_ENABLE                 ((uint32_t)0x00000400U)         /* !< Enable */
/* ADC12_CTL2[RSTSAMPCAPEN] Bits */
#define ADC12_CTL2_RSTSAMPCAPEN_OFS              (4)                             /* !< RSTSAMPCAPEN Offset */
#define ADC12_CTL2_RSTSAMPCAPEN_MASK             ((uint32_t)0x00000010U)         /* !< 0: Sample and hold capacitor is not
                                                                                    explicitly discharged at the end of
                                                                                    conversion. 1: Sample and hold
                                                                                    capacitor is discharged at the end of
                                                                                    conversion. This incurs one
                                                                                    additional conversion clock cycle. */
#define ADC12_CTL2_RSTSAMPCAPEN_DISABLE          ((uint32_t)0x00000000U)         /* !< Disable sample capacitor discharge
                                                                                    feature. */
#define ADC12_CTL2_RSTSAMPCAPEN_ENABLE           ((uint32_t)0x00000010U)         /* !< Enable sample capacitor discharge
                                                                                    feature. */

/* ADC12_CLKFREQ Bits */
/* ADC12_CLKFREQ[FRANGE] Bits */
#define ADC12_CLKFREQ_FRANGE_OFS                 (0)                             /* !< FRANGE Offset */
#define ADC12_CLKFREQ_FRANGE_MASK                ((uint32_t)0x00000007U)         /* !< Frequency Range. */
#define ADC12_CLKFREQ_FRANGE_RANGE1TO4           ((uint32_t)0x00000000U)         /* !< 1 to 4 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE4TO8           ((uint32_t)0x00000001U)         /* !< >4 to 8 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE8TO16          ((uint32_t)0x00000002U)         /* !< >8 to 16 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE16TO20         ((uint32_t)0x00000003U)         /* !< >16 to 20 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE20TO24         ((uint32_t)0x00000004U)         /* !< >20 to 24 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE24TO32         ((uint32_t)0x00000005U)         /* !< >24 to 32 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE32TO40         ((uint32_t)0x00000006U)         /* !< >32 to 40 MHz */
#define ADC12_CLKFREQ_FRANGE_RANGE40TO48         ((uint32_t)0x00000007U)         /* !< >40 to 48 MHz */

